app/controllers/departments_controller.rb

SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 1)
SELECT * FROM `departments` WHERE (`departments`.`hospital_id` = 1) ORDER BY name
---
  def index
    @hospital = Hospital.find(params[:hospital_id])
    @departments = Department.find_all_by_hospital_id(@hospital.id, :order => :name)

SELECT * FROM `departments` WHERE (`departments`.`id` = 980190963)
---
  def show
    @department = Department.find(params[:id])

SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 1)
---
  def new
    redirect_to :action => "index", :hospital_id => params[:hospital_id] unless hospital_admin?(params[:hospital_id])
    @hospital = Hospital.find(params[:hospital_id])

INSERT INTO `departments` (`created_at`, `updated_at`, `name`, `hospital_id`, `description`) VALUES('2011-01-06 04:50:39', '2011-01-06 04:50:39', 'Oncology', 1, 'Cancer research and treatment ')
---
  def create
    @department = Department.new(params[:department])
    puts "\n----------------------------"
    puts @department.hospital_id
    puts "----------------------------\n"
    if @department.save