app/controllers/hospitals_controller.rb

  def index
    @hospital_accounts = Account.find(:all, :conditions => ['account_type = ?', Account::HOSPITAL])
    @hospitals = {}
    @hospital_accounts.each do |account|
      account_users = account.users.collect {|user| user.id}
---
SELECT * FROM `accounts` WHERE (account_type = 1)
SELECT * FROM `hospitals` ORDER BY hospitals.id DESC LIMIT 1
SELECT * FROM `users` WHERE (`users`.account_id = 2)

  def show
    @hospital = Hospital.find(params[:id])
---
SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 1)

  def create
    puts "\n=====================\n"
    puts params[:account_id]
    puts "=====================\n"
    ActiveRecord::Base.transaction do
      @user = User.new(:name => params[:admin_name],
                                 :email => params[:email],
                                 :user_name => params[:user_name],
                                 :password => params[:password],
                                 :password_confirmation => params[:password_confirmation] )

      @user.account_id = params[:account_id].to_i
      @user.admin = User::ADMIN
      if @user.save!
        @hospital = Hospital.new(:name => params[:hospital_name],
                                              :address => params[:address],
                                              :city  => params[:city],
                                              :state =>params[:state],
                                              :country => params[:country],
                                              :zipcode => params[:zipcode],
                                              :user_id => @user.id)
        if @hospital.save!
---
INSERT INTO `users` (`user_name`, `name`, `email`, `crypted_password`, `salt`, `created_at`, `updated_at`, `remember_token`, `remember_token_expires_at`, `admin`, `account_id`) VALUES('ssaoji', 'S Saoji', 'ssaoji@gmail.com', 'f6f84a79022cf18b4a393365c05842a07c892687', '80e746033f86a8192be107228949c41cd3315505', '2010-12-23 08:20:22', '2010-12-23 08:20:22', NULL, NULL, 3, NULL)
INSERT INTO `hospitals` (`created_at`, `updated_at`, `name`, `address`, `city`, `state`, `country`, `zipcode`, `user_id`) VALUES('2010-12-23 07:43:17', '2010-12-23 07:43:17', NULL, NULL, NULL, NULL, NULL, NULL, NULL)

  def create_new_account
    puts params[:account_name]
    ActiveRecord::Base.transaction do
      account = Account.new(:name => params[:account_name], :account_type => Account::HOSPITAL)
      if(account.save!)
        user = User.new(:name => params[:name],
                                 :user_name => params[:user_name],
                                :email => params[:email],
                                :password => params[:password],
                                :password_confirmation => params[:password_confirmation])
        user.account_id = account.id
        user.admin = User::ACCOUNT_ADMIN
        user.save!
---
INSERT INTO `accounts` (`created_at`, `updated_at`, `name`, `account_type`) VALUES('2010-12-23 02:34:23', '2010-12-23 02:34:23', 'Apollo Hospitals', 1)
INSERT INTO `users` (`user_name`, `name`, `email`, `crypted_password`, `salt`, `created_at`, `updated_at`, `remember_token`, `remember_token_expires_at`, `admin`, `account_id`) VALUES('shon', 'shon', 'shon@gmail.com', '7908307dbd86bf2871aa0584517b4a7e62acb4ac', '02bfc749d1f8ce22004fd548536b82d03f3fba56', '2010-12-23 02:40:08', '2010-12-23 02:40:08', NULL, NULL, 2, 5)