app/controllers/med_replies_controller.rb

  def edit
    @med_reply = MedReply.find(params[:id])
---
SELECT * FROM `med_replies` WHERE (`med_replies`.`id` = 3)

  def create

		@med_reply = current_user.med_replies.build(params[:med_reply])
		@med_post = MedPost.find(@med_reply.med_post_id)
		@med_post.med_replies << @med_reply
---
SELECT * FROM `med_posts` WHERE (`med_posts`.`id` = 1)
INSERT INTO `med_replies` (`created_at`, `updated_at`, `user_id`, `content`, `med_post_id`) VALUES('2011-02-07 05:37:09', '2011-02-07 05:37:09', NULL, 'This is my first comment on this blog', 1)

  def update
    @med_reply = MedReply.find(params[:id])

    respond_to do |format|
      if @med_reply.update_attributes(params[:med_reply])
---
SELECT * FROM `med_replies` WHERE (`med_replies`.`id` = 3)
UPDATE `med_replies` SET `content` = 'first comment for first post edit 3', `updated_at` = '2011-02-07 09:31:21' WHERE `id` = 3

  def delete
    @med_reply = MedReply.find(params[:id])
    @med_post = @med_reply.med_post_id
		@med_reply.destroy
---
SELECT * FROM `med_replies` WHERE (`med_replies`.`id` = 3)
DELETE FROM `med_replies` WHERE `id` = 3