app/controllers/med_post_categories_controller.rb

SELECT * FROM `med_post_categories`
---
  def index
    @med_post_categories = MedPostCategory.all

SELECT * FROM `med_post_categories` WHERE (`med_post_categories`.`id` = 0)
---
  def show
    @med_post_category = MedPostCategory.find(params[:id])

INSERT INTO `med_post_categories` (`created_at`, `title`, `updated_at`, `total_ratings`, `plus_ratings`) VALUES('2011-02-06 19:58:28', 'General', '2011-02-06 19:58:28', NULL, NULL)
---
  def create
    @med_post_category = MedPostCategory.new(params[:med_post_category])

    respond_to do |format|
      if @med_post_category.save