app/controllers/med_posts_controller.rb

SELECT * FROM `med_posts` WHERE (`med_posts`.`id` = 3)
---
  def show
    @med_post = MedPost.find(params[:id])

SELECT * FROM `med_posts` WHERE (`med_posts`.`id` = 1)
---
  def edit
    @med_post = MedPost.find(params[:id])

SELECT * FROM `med_posts` WHERE (med_post_category_id=1)
---
  def search
    @search_options = Search_option.new(params[:search_for])
		@temp = 0
		if (params[:id].nil?)
			session[:search_category] = @search_options.category
			session[:search_keywords] = @search_options.keywords
			session[:search_data_valid] = true
			@temp=1
		elsif	(session[:search_data_valid])
			@search_options.category = session[:search_category]
			@search_options.keywords = session[:search_keywords]
			@temp= @temp + 3
		else
			@search_options.category = "THISISANINVALIDCATEGORY_1287623"
			@search_options.keywords = ""
			@temp= @temp + 6
		end

    @med_posts = MedPost.find(:all,
			                        :conditions => [
																               "med_post_category_id=?",
																							 @search_options.category
																						 ]
														 )

SELECT * FROM `med_post_categories` WHERE (`med_post_categories`.`id` = 1)
INSERT INTO `med_posts` (`created_at`, `title`, `updated_at`, `user_id`, `content`, `med_post_category_id`, `total_ratings`, `plus_ratings`) VALUES('2011-02-06 20:53:50', 'My first post', '2011-02-06 20:53:50', 1, 'this is my first post for the blog system', 1, NULL, NULL)
---
  def create
    @med_post = current_user.med_posts.build(params[:med_post])
		@med_category = MedPostCategory.find(@med_post.med_post_category_id)
		@med_category.med_posts << @med_post

SELECT * FROM `med_posts` WHERE (`med_posts`.`id` = 3)
UPDATE `med_posts` SET `updated_at` = '2011-02-07 08:15:45', `title` = 'my second post for a while' WHERE `id` = 2
---
  def update
    @med_post = MedPost.find(params[:id])

    respond_to do |format|
      if @med_post.update_attributes(params[:med_post])