app/controllers/medical_procedures_controller.rb

SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 1)
---
  def index
    @hospital = Hospital.find(params[:hospital_id])

SELECT * FROM `medical_procedures` WHERE (`medical_procedures`.`id` = 2)
SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 1)
SELECT `departments`.* FROM `departments` INNER JOIN `departments_medical_procedures` ON `departments`.id = `departments_medical_procedures`.department_id WHERE ((`departments_medical_procedures`.medical_procedure_id = 1))
SELECT `departments`.id FROM `departments` WHERE (`departments`.`id` = 2) AND (`departments`.hospital_id = 1) LIMIT 1
---
  def show
    @medical_procedure = MedicalProcedure.find(params[:id])

    if params[:hospital_id]
      @hospital = Hospital.find(params[:hospital_id])
      h_departments = @hospital.departments
      p_departments = @medical_procedure.departments
      p_departments.each do |procedure_dept|
        @deparment = h_departments.include?(procedure_dept)
      end
    else
      @department = Department.find(params[:department_id])

SELECT * FROM `hospitals` WHERE (`hospitals`.`id` = 1)
SELECT * FROM `departments` WHERE (`departments`.hospital_id = 1)
---
  def new
    @medical_procedure = MedicalProcedure.new
    @hospital = Hospital.find(params[:hospital_id].to_i) if params[:hospital_id]
    @department = Department.find(params[:department].to_i) if params[:department]

SELECT * FROM `departments` WHERE (`departments`.`id` = 1)
INSERT INTO `departments_medical_procedures` (`created_at`, `cost`, `updated_at`, `medical_procedure_id`, `department_id`) VALUES('2011-01-30 04:31:58', NULL, '2011-01-30 04:31:58', 3, 1)
INSERT INTO `medical_procedures` (`name`, `created_at`, `updated_at`, `description`) VALUES('Lung Cancer', '2011-01-30 04:24:49', '2011-01-30 04:24:49', 'Latest research in the field of lung cancer')
---
  def create
    @medical_procedure = MedicalProcedure.new(params[:medical_procedure])
    @department = Department.find(params[:department_id])

    if @medical_procedure.save

SELECT * FROM `departments` WHERE (`departments`.`id` = 3)
---
  def department_procedures
    @department = Department.find(params[:department])