app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`user_name`, `name`, `email`, `crypted_password`, `salt`, `created_at`, `updated_at`, `remember_token`, `remember_token_expires_at`, `age`, `address`, `city`, `state`, `country`, `zipcode`, `role`, `status`, `type`) VALUES('shon.saoji', '', 'shon.saoji@gmail.com', '924235e4e4291842f411f05aad704c9d175d8ba6', 'bcfc8c35b0c17f253ee4510ac4ba3e19f1d0ceac', '2010-07-18 02:37:39', '2010-07-18 02:37:39', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)